XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/uart_reg.h
/* 0x54 : utx_rs485_cfg */
#define UART_UTX_RS485_CFG_OFFSET  (0x54)
#define UART_CR_UTX_RS485_EN       UART_CR_UTX_RS485_EN
#define UART_CR_UTX_RS485_EN_POS   (0U)
#define UART_CR_UTX_RS485_EN_LEN   (1U)
#define UART_CR_UTX_RS485_EN_MSK   (((1U << UART_CR_UTX_RS485_EN_LEN) - 1) << UART_CR_UTX_RS485_EN_POS)
#define UART_CR_UTX_RS485_EN_UMSK  (~(((1U << UART_CR_UTX_RS485_EN_LEN) - 1) << UART_CR_UTX_RS485_EN_POS))
#define UART_CR_UTX_RS485_POL      UART_CR_UTX_RS485_POL
#define UART_CR_UTX_RS485_POL_POS  (1U)
#define UART_CR_UTX_RS485_POL_LEN  (1U)
#define UART_CR_UTX_RS485_POL_MSK  (((1U << UART_CR_UTX_RS485_POL_LEN) - 1) << UART_CR_UTX_RS485_POL_POS)
#define UART_CR_UTX_RS485_POL_UMSK (~(((1U << UART_CR_UTX_RS485_POL_LEN) - 1) << UART_CR_UTX_RS485_POL_POS))

/* 0x80 : uart_fifo_config_0 */
#define UART_FIFO_CONFIG_0_OFFSET   (0x80)
#define UART_DMA_TX_EN              UART_DMA_TX_EN
#define UART_DMA_TX_EN_POS          (0U)
#define UART_DMA_TX_EN_LEN          (1U)
#define UART_DMA_TX_EN_MSK          (((1U << UART_DMA_TX_EN_LEN) - 1) << UART_DMA_TX_EN_POS)
#define UART_DMA_TX_EN_UMSK         (~(((1U << UART_DMA_TX_EN_LEN) - 1) << UART_DMA_TX_EN_POS))
#define UART_DMA_RX_EN              UART_DMA_RX_EN
#define UART_DMA_RX_EN_POS          (1U)
#define UART_DMA_RX_EN_LEN          (1U)
#define UART_DMA_RX_EN_MSK          (((1U << UART_DMA_RX_EN_LEN) - 1) << UART_DMA_RX_EN_POS)
#define UART_DMA_RX_EN_UMSK         (~(((1U << UART_DMA_RX_EN_LEN) - 1) << UART_DMA_RX_EN_POS))
#define UART_TX_FIFO_CLR            UART_TX_FIFO_CLR
#define UART_TX_FIFO_CLR_POS        (2U)
#define UART_TX_FIFO_CLR_LEN        (1U)
#define UART_TX_FIFO_CLR_MSK        (((1U << UART_TX_FIFO_CLR_LEN) - 1) << UART_TX_FIFO_CLR_POS)
#define UART_TX_FIFO_CLR_UMSK       (~(((1U << UART_TX_FIFO_CLR_LEN) - 1) << UART_TX_FIFO_CLR_POS))
#define UART_RX_FIFO_CLR            UART_RX_FIFO_CLR
#define UART_RX_FIFO_CLR_POS        (3U)
#define UART_RX_FIFO_CLR_LEN        (1U)
#define UART_RX_FIFO_CLR_MSK        (((1U << UART_RX_FIFO_CLR_LEN) - 1) << UART_RX_FIFO_CLR_POS)
#define UART_RX_FIFO_CLR_UMSK       (~(((1U << UART_RX_FIFO_CLR_LEN) - 1) << UART_RX_FIFO_CLR_POS))
#define UART_TX_FIFO_OVERFLOW       UART_TX_FIFO_OVERFLOW
#define UART_TX_FIFO_OVERFLOW_POS   (4U)
#define UART_TX_FIFO_OVERFLOW_LEN   (1U)
#define UART_TX_FIFO_OVERFLOW_MSK   (((1U << UART_TX_FIFO_OVERFLOW_LEN) - 1) << UART_TX_FIFO_OVERFLOW_POS)
#define UART_TX_FIFO_OVERFLOW_UMSK  (~(((1U << UART_TX_FIFO_OVERFLOW_LEN) - 1) << UART_TX_FIFO_OVERFLOW_POS))
#define UART_TX_FIFO_UNDERFLOW      UART_TX_FIFO_UNDERFLOW
#define UART_TX_FIFO_UNDERFLOW_POS  (5U)
#define UART_TX_FIFO_UNDERFLOW_LEN  (1U)
#define UART_TX_FIFO_UNDERFLOW_MSK  (((1U << UART_TX_FIFO_UNDERFLOW_LEN) - 1) << UART_TX_FIFO_UNDERFLOW_POS)
#define UART_TX_FIFO_UNDERFLOW_UMSK (~(((1U << UART_TX_FIFO_UNDERFLOW_LEN) - 1) << UART_TX_FIFO_UNDERFLOW_POS))
#define UART_RX_FIFO_OVERFLOW       UART_RX_FIFO_OVERFLOW
#define UART_RX_FIFO_OVERFLOW_POS   (6U)
#define UART_RX_FIFO_OVERFLOW_LEN   (1U)
#define UART_RX_FIFO_OVERFLOW_MSK   (((1U << UART_RX_FIFO_OVERFLOW_LEN) - 1) << UART_RX_FIFO_OVERFLOW_POS)
#define UART_RX_FIFO_OVERFLOW_UMSK  (~(((1U << UART_RX_FIFO_OVERFLOW_LEN) - 1) << UART_RX_FIFO_OVERFLOW_POS))
#define UART_RX_FIFO_UNDERFLOW      UART_RX_FIFO_UNDERFLOW
#define UART_RX_FIFO_UNDERFLOW_POS  (7U)
#define UART_RX_FIFO_UNDERFLOW_LEN  (1U)
#define UART_RX_FIFO_UNDERFLOW_MSK  (((1U << UART_RX_FIFO_UNDERFLOW_LEN) - 1) << UART_RX_FIFO_UNDERFLOW_POS)
#define UART_RX_FIFO_UNDERFLOW_UMSK (~(((1U << UART_RX_FIFO_UNDERFLOW_LEN) - 1) << UART_RX_FIFO_UNDERFLOW_POS))

/* 0x84 : uart_fifo_config_1 */
#define UART_FIFO_CONFIG_1_OFFSET (0x84)
#define UART_TX_FIFO_CNT          UART_TX_FIFO_CNT
#define UART_TX_FIFO_CNT_POS      (0U)
#define UART_TX_FIFO_CNT_LEN      (6U)
#define UART_TX_FIFO_CNT_MSK      (((1U << UART_TX_FIFO_CNT_LEN) - 1) << UART_TX_FIFO_CNT_POS)
#define UART_TX_FIFO_CNT_UMSK     (~(((1U << UART_TX_FIFO_CNT_LEN) - 1) << UART_TX_FIFO_CNT_POS))
#define UART_RX_FIFO_CNT          UART_RX_FIFO_CNT
#define UART_RX_FIFO_CNT_POS      (8U)
#define UART_RX_FIFO_CNT_LEN      (6U)
#define UART_RX_FIFO_CNT_MSK      (((1U << UART_RX_FIFO_CNT_LEN) - 1) << UART_RX_FIFO_CNT_POS)
#define UART_RX_FIFO_CNT_UMSK     (~(((1U << UART_RX_FIFO_CNT_LEN) - 1) << UART_RX_FIFO_CNT_POS))
#define UART_TX_FIFO_TH           UART_TX_FIFO_TH
#define UART_TX_FIFO_TH_POS       (16U)
#define UART_TX_FIFO_TH_LEN       (5U)
#define UART_TX_FIFO_TH_MSK       (((1U << UART_TX_FIFO_TH_LEN) - 1) << UART_TX_FIFO_TH_POS)
#define UART_TX_FIFO_TH_UMSK      (~(((1U << UART_TX_FIFO_TH_LEN) - 1) << UART_TX_FIFO_TH_POS))
#define UART_RX_FIFO_TH           UART_RX_FIFO_TH
#define UART_RX_FIFO_TH_POS       (24U)
#define UART_RX_FIFO_TH_LEN       (5U)
#define UART_RX_FIFO_TH_MSK       (((1U << UART_RX_FIFO_TH_LEN) - 1) << UART_RX_FIFO_TH_POS)
#define UART_RX_FIFO_TH_UMSK      (~(((1U << UART_RX_FIFO_TH_LEN) - 1) << UART_RX_FIFO_TH_POS))

/* 0x88 : uart_fifo_wdata */
#define UART_FIFO_WDATA_OFFSET (0x88)
#define UART_FIFO_WDATA        UART_FIFO_WDATA
#define UART_FIFO_WDATA_POS    (0U)
#define UART_FIFO_WDATA_LEN    (8U)
#define UART_FIFO_WDATA_MSK    (((1U << UART_FIFO_WDATA_LEN) - 1) << UART_FIFO_WDATA_POS)
#define UART_FIFO_WDATA_UMSK   (~(((1U << UART_FIFO_WDATA_LEN) - 1) << UART_FIFO_WDATA_POS))

/* 0x8C : uart_fifo_rdata */
#define UART_FIFO_RDATA_OFFSET (0x8C)
#define UART_FIFO_RDATA        UART_FIFO_RDATA
#define UART_FIFO_RDATA_POS    (0U)
#define UART_FIFO_RDATA_LEN    (8U)
#define UART_FIFO_RDATA_MSK    (((1U << UART_FIFO_RDATA_LEN) - 1) << UART_FIFO_RDATA_POS)
#define UART_FIFO_RDATA_UMSK   (~(((1U << UART_FIFO_RDATA_LEN) - 1) << UART_FIFO_RDATA_POS))

struct uart_reg {
    /* 0x0 : utx_config */
    union {
        struct {
            uint32_t cr_utx_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_utx_cts_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_utx_frm_en    : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cr_utx_lin_en    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_utx_prt_en    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_utx_prt_sel   : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_utx_ir_en     : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_utx_ir_inv    : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_utx_bit_cnt_d : 3;  /* [10: 8],        r/w,        0x7 */
            uint32_t cr_utx_bit_cnt_p : 2;  /* [12:11],        r/w,        0x1 */
            uint32_t cr_utx_bit_cnt_b : 3;  /* [15:13],        r/w,        0x4 */
            uint32_t cr_utx_len       : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } utx_config;

    /* 0x4 : urx_config */
    union {
        struct {
            uint32_t cr_urx_en        : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_urx_abr_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2       : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t cr_urx_lin_en    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t cr_urx_prt_en    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t cr_urx_prt_sel   : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cr_urx_ir_en     : 1;  /* [    6],        r/w,        0x0 */
            uint32_t cr_urx_ir_inv    : 1;  /* [    7],        r/w,        0x0 */
            uint32_t cr_urx_bit_cnt_d : 3;  /* [10: 8],        r/w,        0x7 */
            uint32_t cr_urx_deg_en    : 1;  /* [   11],        r/w,        0x0 */
            uint32_t cr_urx_deg_cnt   : 4;  /* [15:12],        r/w,        0x0 */
            uint32_t cr_urx_len       : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_config;

    /* 0x8 : uart_bit_prd */
    union {
        struct {
            uint32_t cr_utx_bit_prd : 16; /* [15: 0],        r/w,       0xff */
            uint32_t cr_urx_bit_prd : 16; /* [31:16],        r/w,       0xff */
        } BF;
        uint32_t WORD;
    } uart_bit_prd;

    /* 0xC : data_config */
    union {
        struct {
            uint32_t cr_uart_bit_inv : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31   : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } data_config;

    /* 0x10 : utx_ir_position */
    union {
        struct {
            uint32_t cr_utx_ir_pos_s : 16; /* [15: 0],        r/w,       0x70 */
            uint32_t cr_utx_ir_pos_p : 16; /* [31:16],        r/w,       0x9f */
        } BF;
        uint32_t WORD;
    } utx_ir_position;

    /* 0x14 : urx_ir_position */
    union {
        struct {
            uint32_t cr_urx_ir_pos_s : 16; /* [15: 0],        r/w,       0x6f */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_ir_position;

    /* 0x18 : urx_rto_timer */
    union {
        struct {
            uint32_t cr_urx_rto_value : 8;  /* [ 7: 0],        r/w,        0xf */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_rto_timer;

