XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/uart_reg.h
    /* 0x1C : uart_sw_mode */
    union {
        struct {
            uint32_t cr_utx_txd_sw_mode : 1;  /* [    0],        r/w,        0x0 */
            uint32_t cr_utx_txd_sw_val  : 1;  /* [    1],        r/w,        0x0 */
            uint32_t cr_urx_rts_sw_mode : 1;  /* [    2],        r/w,        0x0 */
            uint32_t cr_urx_rts_sw_val  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31      : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_sw_mode;

    /* 0x20 : UART interrupt status */
    union {
        struct {
            uint32_t utx_end_int    : 1;  /* [    0],          r,        0x0 */
            uint32_t urx_end_int    : 1;  /* [    1],          r,        0x0 */
            uint32_t utx_frdy_int   : 1;  /* [    2],          r,        0x1 */
            uint32_t urx_frdy_int   : 1;  /* [    3],          r,        0x0 */
            uint32_t urx_rto_int    : 1;  /* [    4],          r,        0x0 */
            uint32_t urx_pce_int    : 1;  /* [    5],          r,        0x0 */
            uint32_t utx_fer_int    : 1;  /* [    6],          r,        0x0 */
            uint32_t urx_fer_int    : 1;  /* [    7],          r,        0x0 */
            uint32_t urx_lse_int    : 1;  /* [    8],          r,        0x0 */
            uint32_t urx_bcr_int    : 1;  /* [    9],          r,        0x0 */
            uint32_t urx_ads_int    : 1;  /* [   10],          r,        0x0 */
            uint32_t urx_ad5_int    : 1;  /* [   11],          r,        0x0 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_sts;

    /* 0x24 : UART interrupt mask */
    union {
        struct {
            uint32_t cr_utx_end_mask  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_urx_end_mask  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_utx_frdy_mask : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_urx_frdy_mask : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_urx_rto_mask  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_urx_pce_mask  : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_utx_fer_mask  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_urx_fer_mask  : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_urx_lse_mask  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_urx_bcr_mask  : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_urx_ads_mask  : 1;  /* [   10],        r/w,        0x1 */
            uint32_t cr_urx_ad5_mask  : 1;  /* [   11],        r/w,        0x1 */
            uint32_t reserved_12_31   : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_mask;

    /* 0x28 : UART interrupt clear */
    union {
        struct {
            uint32_t cr_utx_end_clr : 1;  /* [    0],        w1c,        0x0 */
            uint32_t cr_urx_end_clr : 1;  /* [    1],        w1c,        0x0 */
            uint32_t rsvd_2         : 1;  /* [    2],       rsvd,        0x0 */
            uint32_t rsvd_3         : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t cr_urx_rto_clr : 1;  /* [    4],        w1c,        0x0 */
            uint32_t cr_urx_pce_clr : 1;  /* [    5],        w1c,        0x0 */
            uint32_t rsvd_6         : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t rsvd_7         : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t cr_urx_lse_clr : 1;  /* [    8],        w1c,        0x0 */
            uint32_t cr_urx_bcr_clr : 1;  /* [    9],        w1c,        0x0 */
            uint32_t cr_urx_ads_clr : 1;  /* [   10],        w1c,        0x0 */
            uint32_t cr_urx_ad5_clr : 1;  /* [   11],        w1c,        0x0 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_clear;

    /* 0x2C : UART interrupt enable */
    union {
        struct {
            uint32_t cr_utx_end_en  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_urx_end_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_utx_frdy_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_urx_frdy_en : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_urx_rto_en  : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_urx_pce_en  : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_utx_fer_en  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_urx_fer_en  : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_urx_lse_en  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_urx_bcr_en  : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_urx_ads_en  : 1;  /* [   10],        r/w,        0x1 */
            uint32_t cr_urx_ad5_en  : 1;  /* [   11],        r/w,        0x1 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_int_en;

    /* 0x30 : uart_status */
    union {
        struct {
            uint32_t sts_utx_bus_busy : 1;  /* [    0],          r,        0x0 */
            uint32_t sts_urx_bus_busy : 1;  /* [    1],          r,        0x0 */
            uint32_t reserved_2_31    : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uart_status;

    /* 0x34 : sts_urx_abr_prd */
    union {
        struct {
            uint32_t sts_urx_abr_prd_start : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_0x55  : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } sts_urx_abr_prd;

    /* 0x38 : urx_abr_prd_b01 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit0 : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_bit1 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_abr_prd_b01;

    /* 0x3C : urx_abr_prd_b23 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit2 : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_bit3 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_abr_prd_b23;

    /* 0x40 : urx_abr_prd_b45 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit4 : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_bit5 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_abr_prd_b45;

    /* 0x44 : urx_abr_prd_b67 */
    union {
        struct {
            uint32_t sts_urx_abr_prd_bit6 : 16; /* [15: 0],          r,        0x0 */
            uint32_t sts_urx_abr_prd_bit7 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_abr_prd_b67;

    /* 0x48 : urx_abr_pw_tol */
    union {
        struct {
            uint32_t cr_urx_abr_pw_tol : 8;  /* [ 7: 0],        r/w,        0x3 */
            uint32_t reserved_8_31     : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } urx_abr_pw_tol;

